Revit 2027 API
RebarConstraint.IsToSurface Method
 Checks if the RebarConstraintType of the RebarConstraint is 'ToSurface'.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsToSurface()
Public Function IsToSurface As Boolean
public:
bool IsToSurface()
member IsToSurface : unit -> bool
Return Value
Boolean
 Returns true if the RebarConstraintType of the RebarConstraint is 'ToSurface', false otherwise.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace